In [23]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [24]:
dframe=DataFrame({'k1':list('XXYYZ'),
                 'k2':['alpha','beta','alpha','beta','alpha'],
                 'dataset1':np.random.randn(5),
                 'dataset2':np.random.randn(5)})
dframe

   dataset1  dataset2 k1     k2
0  0.288478  0.649378  X  alpha
1  0.623485  0.103684  X   beta
2 -0.506418  0.437760  Y  alpha
3 -1.042491  0.236503  Y   beta
4 -0.376067 -0.937065  Z  alpha

In [25]:
group1=dframe['dataset1'].groupby(dframe['k1'])
group1

In [26]:
group1.median()

k1
X    0.455982
Y   -0.774455
Z   -0.376067
Name: dataset1, dtype: float64

In [27]:
dframe

   dataset1  dataset2 k1     k2
0  0.288478  0.649378  X  alpha
1  0.623485  0.103684  X   beta
2 -0.506418  0.437760  Y  alpha
3 -1.042491  0.236503  Y   beta
4 -0.376067 -0.937065  Z  alpha

In [28]:
cities=np.array(['NY','LA','LA','NY','NY'])
month=np.array(['JAN','FEB','JAN','FEB','JAN'])

In [29]:
dframe['dataset1'].groupby([cities,month]).max()

LA  FEB    0.623485
    JAN   -0.506418
NY  FEB   -1.042491
    JAN    0.288478
Name: dataset1, dtype: float64

In [30]:
dframe.groupby(['k2']).mean()

       dataset1  dataset2
k2
alpha -0.198002  0.050025
beta  -0.209503  0.170093

In [31]:
dframe.groupby(['k1']).mean()

    dataset1  dataset2
k1
X   0.455982  0.376531
Y  -0.774455  0.337132
Z  -0.376067 -0.937065

In [32]:
dframe.groupby(['dataset1']).mean()

           dataset2
dataset1
-1.042491  0.236503
-0.506418  0.437760
-0.376067 -0.937065
 0.288478  0.649378
 0.623485  0.103684

In [33]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.288478  0.649378
   beta   0.623485  0.103684
Y  alpha -0.506418  0.437760
   beta  -1.042491  0.236503
Z  alpha -0.376067 -0.937065

In [34]:
dframe.groupby(['k2','k1']).median()

          dataset1  dataset2
k2    k1
alpha X   0.288478  0.649378
      Y  -0.506418  0.437760
      Z  -0.376067 -0.937065
beta  X   0.623485  0.103684
      Y  -1.042491  0.236503

In [35]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [36]:
dframe

   dataset1  dataset2 k1     k2
0  0.288478  0.649378  X  alpha
1  0.623485  0.103684  X   beta
2 -0.506418  0.437760  Y  alpha
3 -1.042491  0.236503  Y   beta
4 -0.376067 -0.937065  Z  alpha

In [40]:
for name,group in dframe.groupby('k1'):
    print name
    print group
    print '\n'

X
   dataset1  dataset2 k1     k2
0  0.288478  0.649378  X  alpha
1  0.623485  0.103684  X   beta


Y
   dataset1  dataset2 k1     k2
2 -0.506418  0.437760  Y  alpha
3 -1.042491  0.236503  Y   beta


Z
   dataset1  dataset2 k1     k2
4 -0.376067 -0.937065  Z  alpha

In [41]:
for (k1,k2),group in dframe.groupby(['k1','k2']):
    print "Key1 = %s, Key2 = %s" %(k1,k2)
    print group
    print '\n'

Key1 = X, Key2 = alpha
   dataset1  dataset2 k1     k2
0  0.288478  0.649378  X  alpha


Key1 = X, Key2 = beta
   dataset1  dataset2 k1    k2
1  0.623485  0.103684  X  beta


Key1 = Y, Key2 = alpha
   dataset1  dataset2 k1     k2
2 -0.506418   0.43776  Y  alpha


Key1 = Y, Key2 = beta
   dataset1  dataset2 k1    k2
3 -1.042491  0.236503  Y  beta


Key1 = Z, Key2 = alpha
   dataset1  dataset2 k1     k2
4 -0.376067 -0.937065  Z  alpha

In [44]:
group_dict=dict(list(dframe.groupby('k1')))

In [45]:
group_dict['X']

   dataset1  dataset2 k1     k2
0  0.288478  0.649378  X  alpha
1  0.623485  0.103684  X   beta

In [46]:
dframe

   dataset1  dataset2 k1     k2
0  0.288478  0.649378  X  alpha
1  0.623485  0.103684  X   beta
2 -0.506418  0.437760  Y  alpha
3 -1.042491  0.236503  Y   beta
4 -0.376067 -0.937065  Z  alpha

In [47]:
group_dict

{'X':    dataset1  dataset2 k1     k2
 0  0.288478  0.649378  X  alpha
 1  0.623485  0.103684  X   beta, 'Y':    dataset1  dataset2 k1     k2
 2 -0.506418  0.437760  Y  alpha
 3 -1.042491  0.236503  Y   beta, 'Z':    dataset1  dataset2 k1     k2
 4 -0.376067 -0.937065  Z  alpha}

In [49]:
group_dict_axis1=dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [50]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.288478  0.649378
 1  0.623485  0.103684
 2 -0.506418  0.437760
 3 -1.042491  0.236503
 4 -0.376067 -0.937065, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [51]:
dframe

   dataset1  dataset2 k1     k2
0  0.288478  0.649378  X  alpha
1  0.623485  0.103684  X   beta
2 -0.506418  0.437760  Y  alpha
3 -1.042491  0.236503  Y   beta
4 -0.376067 -0.937065  Z  alpha

In [52]:
dframe.groupby(['k1','k2'])[['dataset2']].mean()

          dataset2
k1 k2
X  alpha  0.649378
   beta   0.103684
Y  alpha  0.437760
   beta   0.236503
Z  alpha -0.937065